## [DataFrame에 행/열 추가]

(1) 모듈 로딩  <hr>

In [18]:
import pandas as pd

(2) 데이터 준비 <hr>

In [19]:
# dict 타입의 데이터 생성.

In [20]:
#DataFrame() 함수로 데이터 프레임 변환. 변수 df에 저장.
exam = {'이름' : [ 'Peter Parker', 'MJ', 'Ned', 'Harry Potter'],

'국어' : [ 100, 94, 95, 32],
'미술' : [ 42, 89, 95, 100],
'수학' : [ 85, 95, 54, 65],
'체육' : [ 100, 90, 43, 100]}

(3) DataFrame에 데이터 저장하기

In [21]:
examDF = pd.DataFrame(exam)

In [22]:
examDF

             이름   국어   미술  수학   체육
0  Peter Parker  100   42  85  100
1            MJ   94   89  95   90
2           Ned   95   95  54   43
3  Harry Potter   32  100  65  100

(4) 저장된 데이터 속성 확인  <hr>

In [26]:
def printAttribute(df, dfname): #함수로 만들어 두면 다음에 불러와서 사용 가능.
    print(f'[{dfname} Attributes]')
    print(f'index \n===> {df.index}')
    print(f'columns \n===> {df.columns}')
    print(f'shape =>\n===> {df.shape}')
    print(f'ndim =>\n===> {df.ndim}')
    print(f'dtypes=>\n===> {df.dtypes}') 
    #type 데이터를 담고 있지만 Series 데이터이기 때문에 반복문을 써서 깔끔한 출력 가능!

In [27]:
# print(f'index \n===> {examDF.index}')
# print(f'columns \n===> {examDF.columns}')
# print(f'shape =>\n===> {examDF.shape}')
# print(f'ndim =>\n===> {examDF.ndim}')
# print(f'dtype=>\n===> {examDF.dtype}')

In [28]:
printAttribute(examDF, 'examDF')

[examDF Attributes]
index
===> RangeIndex(start=0, stop=4, step=1)
columns
===> Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')
shape =>
===> (4, 5)
ndim =>
===> 2
dtypes=>
===> 이름    object
국어     int64
미술     int64
수학     int64
체육     int64
dtype: object

(5) DataFrame에 column 추가 <hr>
- 방법 : DF객체변수명[새로운 컬럼명] = 값

Index(['이름', '국어', '미술', '수학', '체육'])

In [29]:
examDF['영어'] =[90, 89, 100, 99] #행의 개수 만큼 값 추가
examDF

             이름   국어   미술  수학   체육   영어
0  Peter Parker  100   42  85  100   90
1            MJ   94   89  95   90   89
2           Ned   95   95  54   43  100
3  Harry Potter   32  100  65  100   99

In [36]:
examDF['과학'] = 10 #1개의 데이터 즉 값 추가 시 모든 행에 동일 값으로 저장.
# examDF['과학'] = [10] 와 같이 입력하면 오류 발생!
examDF

             이름   국어   미술  수학   체육   영어  과학
0  Peter Parker  100   42  85  100   90  10
1            MJ   94   89  95   90   89  10
2           Ned   95   95  54   43  100  10
3  Harry Potter   32  100  65  100   99  10

In [34]:
examDF['컴퓨터'] = [89, 10] #1개보다 많지만 열의 항목보다 적은 데이터를 입력했을 때는 오류 발생

ValueError: Length of values (2) does not match length of index (4)

In [37]:
examDF[6] = 0 #없는 열 이름에 값을 지정하면 열을 추가하고 기본값을 가진다.
examDF

             이름   국어   미술  수학   체육   영어  과학  6
0  Peter Parker  100   42  85  100   90  10  0
1            MJ   94   89  95   90   89  10  0
2           Ned   95   95  54   43  100  10  0
3  Harry Potter   32  100  65  100   99  10  0

In [40]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '체육', '영어', '과학', 6], dtype='object')

(6) DataFrame에 행(row) 추가 <hr>
-방법 : DF 객체변수명.loc[새로운 행 인덱스] = [Column 수만큼 데이터]
-방법 : DF 객체변수명.loc[새로운 행 인덱스] = ㄷ데이터 # 데이터로 기본값이 입력됨.
-  ※ 주의 :
-   DF 객체변수명.iloc[새로운 행 인덱스] = [Column 수만큼 데이터] ===> 불가능. 데이터가 존재해야 인덱스 할당.

In [41]:
examDF.index

RangeIndex(start=0, stop=4, step=1)

In [43]:
# column 수만큼의 데이터를 가진 행 추가.
examDF.loc[4] = ['Hermione', 100, 99, 98, 90,100, 93, 100]

In [44]:
#행 추가 시 iloc는 사용불가 => Why? 데이터 수에 맞게 인덱스 범위 지정. 현재 인덱스에서 없는 인덱스.
#examDF.iloc[5] = ['Malfoy', 100, 99, 98, 90,100, 93, 100]

IndexError: iloc cannot enlarge its target object

In [47]:
#1개의 데이터를 가진 행 추가
examDF.loc[5] = 'Ron' #

In [48]:
examDF

             이름   국어   미술   수학   체육   영어   과학    6
0  Peter Parker  100   42   85  100   90   10    0
1            MJ   94   89   95   90   89   10    0
2           Ned   95   95   54   43  100   10    0
3  Harry Potter   32  100   65  100   99   10    0
4      Hermione  100   99   98   90  100   93  100
5           Ron  Ron  Ron  Ron  Ron  Ron  Ron  Ron